import React from 'react';
import ReactDOM from 'react-dom/client';
import App from './App.jsx';
import './index.css';

ReactDOM.createRoot(document.getElementById('root')).render(
  <React.StrictMode>
    <App />
  </React.StrictMode>
);

//** МОДУЛЬ_1 **//

//* Знайомство *//

//!! React – це бібліотека, яка дозволяє розробникам ефективно створювати високопродуктивні та легко підтримувані веб-додатки,
//!! використовуючи компонентний підхід та інші сучасні концепції.

// React побудований на концепції реактивності. Під час створення додатку розробник
// не взаємодіє безпосередньо з DOM-деревом та не оновлює інтерфейс самостійно.
// Його завдання полягає в тому, щоб описати інтерфейс за допомогою компонентів
// (шаблону) та керувати зміною даних. React, при зміні даних, автоматично оновлює
// інтерфейс за заданим шаблоном.

// Велика спільнота розробників і дуже розвинута екосистема вспоміжних бібліотек
// дозволяють вирішити будь-яке завдання швидко.

//!! React - мультиплатформний інструмент, з яким можна рендерити розмітку на сервері (Next.js), розробляти нативні (React Native)
//!! або десктопні(Electron) застосунки.При цьому синтаксис залишається однаковим, відрізняються лише використовувані інструменти.

//!! У React відмінна 📖 документація: https://react.dev/, проходження якої ми рекомендуємо в доповнення до основних матеріалів курсу.

//* Створення проекту *//

//?? Створення проєкту
//!! Для створення проєкту необхідно виконати кілька кроків:
// - Створити порожній репозиторій (проект) на GitHub.
// - Клонувати цей репозиторій на свій комп'ютер.
// - Відкрити термінал і перейти до папки, де розташований склонований репозиторій.
// - Запустити створення React-проєкту.

//!! Для створення проєкту будемо використовувати збірник 📖 Vite:
// - Абстрагує всю конфігурацію проєкту, дозволяючи зосередитись на написанні коду.
// - Включає необхідні інструменти, такі як ESLint.
// - Розширюється додатковими пакетами з екосистеми React.

// Для створення нового проекту, перебуваючи в папці проекту в терміналі, виконайте
// команду та слідуйте інструкціям. Використовуйте клавіші вгору/вниз для навігації
// по опціям, та Enter для підтвердження вибору.

//!! npm create vite@latest

// На запитання, як назвати проект, вводимо крапку і натискаєм Enter. Це означає,
// що ми хочемо створити проект у поточній папці. Встановіть залежності проекту
// командою npm install/ Запустіть проект командою npm run dev. Якщо у вас вже
// налаштовано автоматичне форматування за допомогою Prettier у вашому редакторі,
// то досить додати файл його налаштувань у корінь проекту.

//?? Налаштування ESLint
// У проекті, створеному за допомогою Vite, вже налаштований лінтинг - перевірка
// якості коду. Щоб отримувати візуальний фідбек від лінтера в редакторі VSCode,
// потрібно додати розширення ESLint.

// Частини коду, які не відповідають стандартам якості, будуть підкреслені жовтим
// (попередження) або червоним (помилка) пунктиром. При наведенні миші на пунктир
// з'явиться спливаюча підказка з описом проблеми.

// Останнім кроком буде невеличка зміна налаштувань лінтера ESLint. У файлі
// налаштувань .eslintrc.cjs потрібно відключити одне непотрібне нам правило.
// Зокрема, додайте до блоку rules властивість react/prop-types із значенням 0.

// Потрібно взяти наступний код, який містить потрібні налаштування, і замінити ним
// вміст файлу .eslintrc.cjs.

// module.exports = {
//   root: true,
//   env: { browser: true, es2020: true },
//   extends: [
//     "eslint:recommended",
//     "plugin:react/recommended",
//     "plugin:react/jsx-runtime",
//     "plugin:react-hooks/recommended",
//   ],
//   ignorePatterns: ["dist", ".eslintrc.cjs"],
//   parserOptions: { ecmaVersion: "latest", sourceType: "module" },
//   settings: { react: { version: "18.2" } },
//   plugins: ["react-refresh"],
//   rules: {
//     "react/prop-types": 0,
//     "react-refresh/only-export-components": [
//       "warn",
//       { allowConstantExport: true },
//     ],
//   },
// };

//?? Налаштування Vite
// Код проекту за замовчуванням мініфікується і обфускується в продакшені, щоб
// оптимізувати завантаження додатка. Проте це може ускладнити перевірку коду
// ментором під час оцінювання домашніх завдань на живій сторінці.

// Source Map є інструментом, який дозволяє відображати транспільований або
// мініфікований код у вихідний код, зроблено це для комфортного перегляду в
// інструментах розробника браузера. Забезпечуючи можливість переглядати зручно
// читабельний код навіть після компіляції.

// Додаємо опцію генерування Source Maps у файл налаштувань Vite, який розташований
// у кореневій папці проекту. Відкрий файл vite.config.js та заміни його вміст на
// наступний код.

// import { defineConfig } from "vite";
// import react from "@vitejs/plugin-react";

// // https://vitejs.dev/config/
// export default defineConfig({
//   plugins: [react()],
//   build: {
//     sourcemap: true,
//   }
// });

//* Інструменти розробника *//

//!! React Developer Tools — це набір корисних інструментів, які допомагають розробникам відстежувати, аналізувати та налагоджувати
//!! свої React - застосунки.Вони допомагають зрозуміти, як працюють компоненти, і забезпечують інструменти для вирішення можливих проблем. -- >

//!! 📖 Документація React Developer Tools: https://react.dev/learn/react-developer-tools
// Необхідно встановити розширення для браузера, і при запуску застосунка через
// npm-скрипт, на веб-сторінці ви зможете переглядати дерево компонентів, їх стан
// та властивості.

//* Компоненти *//

// Інтерфейс користувача складається з невеликих елементів, таких як кнопки, текст
// і зображення. React дозволяє вам об'єднувати їх у багаторазово використовувані
// компоненти - основні будівельні блоки React-застосунків, за допомогою яких
// інтерфейс розділяється на незалежні частини. Любий інтерфейс (дизайн) можна
// розбити на компоненти.

//!! React-застосунок можна уявити як дерево компонентів. На верхньому рівні стоїть кореневий компонент, у якому вкладена довільна
//!! кількість інших компонентів.Кожен компонент повинен повернути розмітку, тим самим вказуючи, який HTML ми хочемо відрендерити в DOM.

// У нашому застосунку кореневий компонент - це App, саме в нього ми будемо вкладати інші компоненти.

//?? Оголошення компонента-->
//!!В коді компонент - це функція, яка отримує об'єкт властивостей, який називається props, і повертає React-елементи (HTML розмітку).

// Розглянемо компонент Product, який наразі не отримує жодних props, але повертає розмітку картки товару.

// const Product = () => {
//   return (
//     <div>
//       <h2>Cookies</h2>
// 			<p>Price: 999 credits</p>
//     </div>
//   );
// };

// Замініть вміст файлу App.jsx наступним кодом.Ось компонент App, який відображає три компоненти Product.
// Подивіться, як змінюється веб - сторінка.

// // src/App.jsx

// const Product = () => {
//   return (
//     <div>
//       <h2>Cookies</h2>
// 			<p>Price: 999 credits</p>
//     </div>
//   );
// };

// export default function App() {
//   return (
//     <div>
//       <h1>Products</h1>

//       <Product />
//       <Product />
//       <Product />
//     </div>
//   );
// }

//!! Ім'я компонента обов'язково повинно починатися з великої літери. Назви компонентів з маленької літери зарезервовані для
//!! HTML - елементів.Якщо ви спробуєте назвати компонент product, а не Product, під час рендеру React проігнорує його та відрендерить
//!! тег < product ></ >.

//!! 📖 Документація по компонентам: https://react.dev/learn/your-first-component#components-ui-building-blocks

//* Імпорт та експорт компонентів *
// На практиці буде багато компонентів, і тримати їх усіх в одному файлі не зручно.
// Для кожного компонента створюється окремий файл, тому необхідно експортувати компонент із його файлу.

// Створимо файл Product.jsx у папці src та перенесемо туди оголошення компонента Product. Не забудьте експортувати компонент із його файлу.

// src/Product.jsx

// const Product = () => {
//   return (
//     <div>
//       <h2>Tacos</h2>
//       <p>Price: 999 credits</p>{' '}
//     </div>
//   );
// };

// export default Product;

//!! Зверніть увагу, що ім'я файлу компонента Product.jsx збігається з назвою самого компонента Product. Це неофіційний стандарт,
//!! якого ми будемо дотримуватися.

// Імпортуємо Product в компоненті App, тобто там, де хочемо його використовувати.

// src/App.jsx

// import Product from './Product';

// export default function App() {
//   return (
//     <div>
//       <h1>Best selling</h1>

//       <Product />
//       <Product />
//       <Product />
//     </div>
//   );
// }

// У модулях можна використовувати експорт за замовчуванням (export default) або іменований експорт (export const).

//!! Так як компонент це головна сутність модуля, то давайте домовимось використовувати для нього експорт за замовчуванням
//!! (export default).

// На практиці всі компоненти, а в майбутньому і файли стилів для них, будемо
// зберігати у папці components, яку створимо всередині папки src. Це буде наш
// перший крок до структуризації файлів та папок React-проекту.

// Перенесемо файли App.jsx, App.css і Product.jsx у папку components і виправимо
// імпорт компонента App у файлі main.jsx.

// // src/main.jsx
// // Було
// import App from './App'
// // Стало
// import App from './components/App'

//* JSX - опис UI *
// Кожен компонент містить свій шаблон - HTML розмітку, яку React рендерить у браузері.

//!! React використовує розширення синтаксису під назвою JSX (JavaScript Syntax Extension), щоб представити цю розмітку.

// Додамо розмітку зображення продукту в компонент Product.

// // src/components/Product.jsx

// export const Product = () => {
//   return (
//     <div>
//       <h2>Tacos</h2>
// 			<img src="<https://images.pexels.com/photos/461198/pexels-photo-461198.jpeg?dpr=2&h=480&w=640>" alt="Tacos With Lime" width="640" />
// 			<p>Price: 999 credits</p>
//     </div>
//   );
// };

// Синтаксис JSX дуже схожий на HTML, але має деякі особливості, які слід враховувати.

//!! Якщо тег порожній або самозакриваючийся, його обов'язково треба закрити за допомогою />.
// {<img src="" alt="" />
// <input type="text" /> }

//!! Під час рендерингу компонента також використовується синтаксис JSX, тому обов'язково закривайте тег компонента зі зворотним слешем
//!! (/) перед закриваючою дужкою тега
// {<App />
// <Product />}

//!! Деякі атрибути мають інші назви в порівнянні з HTML; наприклад, атрибут for тега label в JSX називається htmlFor.
// {<label htmlFor="login">
//   <input id="login" />
// </label>}

//!! У будь-яких двох або більше сусідніх тегів повинен бути спільний батько; іншими словами, неможливо повернути таку розмітку з
//!! компонента, оскільки виникне помилка.

// // src/components/Product.jsx

// export const Product = () => {
//   return (
//       <h2>Tacos</h2>
// 		  <img src="https://images.pexels.com/photos/461198/pexels-photo-461198.jpeg?dpr=2&h=480&w=640" alt="Tacos With Lime" width="640" />
//       <p>Price: 999 credits</p>
//   );
// };

//!! Компонент повинен повертати лише одне значення, тому існує правило спільного батька.

// // src/components/Product.jsx

// export const Product = () => {
//   return (
//     <div>
//       <h2>Tacos</h2>
// 			<img src="https://images.pexels.com/photos/461198/pexels-photo-461198.jpeg?dpr=2&h=480&w=640" alt="Tacos With Lime" width="640" />
//       <p>Price: 999 credits</p>
//     </div>
//   );
// };

//!! Якщо зайвий обгортальний тег не потрібен в розмітці, використовуються фрагменти. Синтаксис виглядає як тег без імені.

// // src/components/Product.jsx

// export const Product = () => {
//   return (
//     <>
//       <h2>Tacos</h2>
// 			<img src="https://images.pexels.com/photos/461198/pexels-photo-461198.jpeg?dpr=2&h=480&w=640" alt="Tacos With Lime" width="640" />
//       <p>Price: 999 credits</p>
//     </>
//   );
// };

// Насправді замість "порожнього" тега <></>, React вставляє вбудований компонент Fragment.
// Цей вбудований компонент при рендері розкривається, підставляючи свій вміст.

// У межах JSX можна використовувати будь - який валідний вираз, заключаючи його у фігурні дужки.
// Все інше буде розглядатися як текст.Винесемо значення ціни в змінну price і використаємо її для того, щоб підставити значення змінної
// в JSX.

// // src/components/Product.jsx

// export const Product = () => {
// 	const price = 999;

//   return (
//     <>
//       <h2>Tacos</h2>
// 			<img src="<https://images.pexels.com/photos/461198/pexels-photo-461198.jpeg?dpr=2&h=480&w=640>" alt="Tacos With Lime" width="640" />
//       <p>Price: {price} credits</p>
//     </>
//   );
// };

// Значення атрибутів вказуються в подвійних лапках, якщо це звичайний рядок, та у фігурних дужках, якщо значення відрізняється від рядка
// або знаходиться в змінній.

// // src/components/Product.jsx

// export const Product = () => {
// 	const price = 999;
// 	const imgUrl = "<https://images.pexels.com/photos/461198/pexels-photo-461198.jpeg?dpr=2&h=480&w=640>";

//   return (
//     <>
//       <h2>Tacos</h2>
// 			<img src={imgUrl} alt="Tacos With Lime" width="640" />
//       <p>Price: {price} credits</p>
//     </>
//   );
// };

//!! 📖 Документація JSX: https://react.dev/learn/writing-markup-with-jsx

//* Властивості компонента (props) *

// Компоненти приймають довільні властивості (налаштування, пропси) і повертають розмітку, яку потрібно відрендерити в DOM.
// Без пропсів компонент завжди повертає однакову розмітку, як, наприклад, наш компонент Product.

// // src/components/Product.jsx

// export const Product = () => {
//   return (
//     <div>
//       <h2>Tacos</h2>
// 			<img src="https://images.pexels.com/photos/461198/pexels-photo-461198.jpeg?dpr=2&h=480&w=640" alt="Tacos With Lime" width="640" />
// 			<p>Price: 999 credits</p>
//     </div>
//   );
// };

//!! Пропсом може бути текст кнопки, зображення, URL, будь-які дані для компонента. Пропси можуть бути рядками або результатом JS-виразу.
//!! Пропси передаються в компонент в місці його використання, аналогічно аргументам функції.

// // src/components/App.jsx

// import { Product } from './Product';

// export default function App() {
//   return (
//     <div>
//       <h1>Best selling</h1>

//       <Product name="Tacos With Lime" />
//       <Product name="Fries and Burger" />
//     </div>
//   );
// }

// Будь-який компонент, в тому числі Product, оголошує один параметр - props, це завжди буде об'єкт, що містить усі передані пропси.

// // src/components/Product.jsx

// export const Product = props => {
// return (
// eslint-disable-next-line no-irregular-whitespace
//   <div>
//    <h2>{props.name}</h2>
// 			<img src="https://images.pexels.com/photos/461198/pexels-photo-461198.jpeg?dpr=2&h=480&w=640" alt="Tacos With Lime" width="480" />
// 			<p>Price: 999 credits</p>
//   </div>
//  );
// };

//!! Пропси використовуються для передачі динамічних значень для компонента, наприклад, для використання в JSX-розмітці,
//!! використовуючи синтаксис { }.

// Передамо компоненті Products кілька інших властивостей.

// // src/components/App.jsx

// import { Product } from "./Product";

// export default function App() {
//   return (
//     <div>
//       <h1>Best selling</h1>

//       <Product
//         name="Tacos With Lime"
//         imgUrl="https://images.pexels.com/photos/461198/pexels-photo-461198.jpeg?dpr=2&h=480&w=640"
//         price={10.99}
//       />
//       <Product
//         name="Fries and Burger"
//         imgUrl="https://images.pexels.com/photos/70497/pexels-photo-70497.jpeg?dpr=2&h=480&w=640"
//         price={14.29}
//       />
//     </div>
//   );
// }

// В самому компоненті Product використаємо отримані пропси в розмітці.

// // src/components/Product.jsx

// export const Product = props => {
//   return (
//     <div>
//       <h2>{props.name}</h2>
// 			<img src={props.imgUrl} alt={props.name} width="480" />
// 			<p>Price: {props.price} credits</p>
//     </div>
//   );
// };

// Відразу будемо використовувати простий патерн під час роботи з props.
// Оскільки props - це об'єкт, ми можемо деструктуризувати його у підписі функції.
// Це робить код чистішим і читабельнішим.

// // src/components/Product.jsx

// export const Product = ({ name, imgUrl, price }) => {
//   return (
//     <div>
//       <h2>{name}</h2>
// 			<img src={imgUrl} alt={name} width="480" />
// 			<p>Price: {price} credits</p>
//     </div>
//   );
// };

// Тепер веб - сторінка виглядає наступним чином.Дві картки продукта з однаковою розміткою, але різними значеннями.
// Ми створили наш перший компонент, який можна використовувати повторно.

//?? Значення пропсів за замовчуванням
// Що, якщо компонент очікує яке-небудь значення, а його не передали? Під час звернення до властивості об'єкта props отримаємо undefined.
// Для того щоб вказати значення властивостей за замовчуванням, використовується синтаксис значень за замовчуванням під час деструктуризації
// пропсів.

// // src/components/Product.jsx

// const Product = ({
//   name,
//   imgUrl = "https://dummyimage.com/640x480/2a2a2a/ffffff&text=Product+image+placeholder",
//   price,
// }) => (
//   <div>
// 		<h2>{name}</h2>
//     <img src={imgUrl} alt={name} width="480" />
//     <p>Price: {price} credits</p>
//   </div>
// );

// Визначення значення за замовчуванням гарантує, що props.imgUrl матиме значення, навіть якщо його не вказано під час виклику компонента
// у батька.

// // src/components/App.jsx

// export default function App() {
//   return (
//     <div>
//       <h1>Best selling</h1>

//       <Product
//         name="Tacos With Lime"
//         price={10.99}
//       />
//       <Product
//         name="Fries and Burger"
//         imgUrl="https://images.pexels.com/photos/70497/pexels-photo-70497.jpeg?dpr=2&h=480&w=640"
//         price={14.29}
//       />
//     </div>
//   );
// }

//!! Значення за замовчуванням не потрібно задавати всім пропсам; абсолютна більшість це обов'язкові значення для правильної роботи
//!! компонента.Проте, наприклад, значення зображення за замовчуванням може бути корисним. -- >

//!! Підсумок
// Ми створили компонент, який налаштовується і який можна використовувати для відображення товарів.
// Ми передаємо йому дані як пропси, а відповідь - отримуємо дерево React-елементів із підставленими значеннями.
//!! Пропси використовуються для передачі даних від батька до дитини.
//!! Пропси передаються лише вниз по дереву від батьківського компонента.
//!! Пропси доступні лише для читання, їх не можна змінити.

//!! 📖 Документація props: https://react.dev/learn/passing-props-to-a-component

//* Умовний рендеринг *

//!! Умовний рендеринг в React - це механізм, який дозволяє відображати різний контент або компоненти на основі умови.

// Це часто використовується для динамічної зміни відображення компонентів в залежності від різних обставин, наприклад, значень пропсів.

//?? Оператор &&
// Логічний оператор && використовується для рендера розмітки лише у випадку, якщо умова виконується, тобто приводиться до true.

//!! умова && розмітка -->

// Зліва ставиться умова рендеру, справа JSX розмітка, що буде відрендерена якщо умова зліва наближається до true.
// В іншому випадку результатом виразу буде false - значення, яке не рендериться.

// Якщо за умови нічого не повинно бути відрендерено, можна повернути null, undefined або false. Ці значення не будуть відображені.
// У JSX вираз обгортається в {}, щоб відобразити його результат.

// <div>
// 	{умова && розмітка}
// </div>

// Будемо рендерити повідомлення про непрочитані листи лише в разі, якщо масив повідомлень не є порожнім, тобто його довжина більше нуля.

// const Mailbox = ({ username, messages }) => {
//   return (
//     <>
//       <p>Hello {username}</p>
//       {messages.length > 0 && (
//         <p>You have {messages.length} unread messages</p>
//       )}
//     </>
//   );
// };

// Якщо умова приводиться до true, то результатом виразу буде правий операнд, тобто JSX - розмітка.
// В іншому випадку результатом буде false - значення, яке не рендериться.

//?? Тернарний оператор
// Використовується, якщо в результаті перевірки умови потрібно відобразити різну розмітку.

//!! умова ? вміст_якщо_умова_true : вміст_якщо_умова_false -->

// У JSX вираз обгортається в {}, щоб відобразити його результат.

// <div>
// 	{умова ? вміст_якщо_умова_true : вміст_якщо_умова_false}
// </div>

// Якщо умова приводиться до true, відображається розмітка після ?, інакше - розмітка після:.
// Будемо рендерити різні повідомлення про непрочитані листи, в залежності від довжини масиву messages.
// Для цього всередині тега абзацу додаємо JSX-вираз і повертаємо рядок.

// const Mailbox = ({ name, unreadMessages }) => {
//   return (
//     <div>
//       <p>Hello {name}</p>
//       <p>
//         {unreadMessages.length > 0
//           ? `You have ${unreadMessages.length} unread messages`
//           : "No unread messages"}
//       </p>
//     </div>
//   );
// };

// У випадку, коли за умови потрібно відобразити різну розмітку, ми робимо те саме, але результатом виразу є JSX.

// const Mailbox = ({ username, messages }) => {
//   return (
//     <div>
//       <p>Hello {username}</p>
//       {messages.length > 0 ? (
//         <div>
//           <p>You have {messages.length} unread messages</p>
//           <MessageList messages={messages} />
//         </div>
//       ) : (
//         <p>No unread messages</p>
//       )}
//     </div>
//   );
// };

//!! 📖 Документація умовного рендерингу: https://react.dev/learn/conditional-rendering

//* Колекції *

// Для того щоб відрендерити колекцію елементів, використовується масив даних і метод map().
// Callback - функція map() для кожного елемента колекції повертає розмітку.

// [1, 2, 3].map(item => { return <p>{item}</p>; })

// Отже, ми отримуємо масив React-елементів, який можна рендерити. Для цього в JSX ми обгортаємо цей вираз у фігурні дужки {}.

// {/* <div>
// 	{[1, 2, 3].map(item => {
// 		return <div>{item}</div>;
// 	})}
// </div> */}

// Тепер використаємо масив книг для того, щоб відобразити їх як список.
// Ми не розбиваємо приклади на файли, щоб вам було зручніше сприймати інформацію.
// Для практики повторіть код прикладів у своєму проекті, використовуючи окремі файли компонентів.

// const favouriteBooks = [
//   { id: "id-1", name: "JS for beginners" },
//   { id: "id-2", name: "React basics" },
//   { id: "id-3", name: "React Router overview" }
// ];

// const BookList = ({ books }) => {
//   return (
//     <ul>
//       {books.map((book) => {
//         return <li>{book.name}</li>;
//       })}
//     </ul>
//   );
// };

// const App = () => {
//   return (
//     <>
// 			<h1>Books of the week</h1>
//       <BookList books={favouriteBooks} />
//     </>
//   );
// };

//?? Ключі елементів
// Під час виконання коду з прикладу вище з'являється попередження про те, що для елементів списку потрібен "ключ".

//!! Ключ (key) — це спеціальний проп, який потрібно задати під час створення елементів колекції.
// React використовує ключі, щоб визначити, які з елементів в колекції необхідно
// оновити, уникнувши перестворення всіх елементів колекції при найменших змінах.

//!! Ключі повинні бути:
// - Унікальними — ключ елемента повинен бути унікальним лише всередині однієї
//   колекції. Глобально унікальні ключі не мають сенсу.
// - Стабільними — ключ елемента не повинен змінюватися з часом, зі зміною порядку
//   елементів або після оновлення сторінки.

//!! Для ключа не можна використовувати будь-яке значення:
// - Індекси масиву унікальні, проте вони не стабільні — при видаленні або
//   перетасовці елементів індекси змінюються.
// - Дата і час унікальні, але не стабільні, оскільки постійно збільшуються. Таким
//   чином, при кожному рендері створюються нові ключі.
// - Використання випадкового числа еквівалентно тому, що ключі взагалі не
//   використовуються, оскільки випадкові числа не є унікальними або стабільними.

//!! Найкращий спосіб задати ключ — використовувати статичний рядок, який однозначно ідентифікує елемент списку серед інших.

// Найчастіше використовуються ідентифікатори об'єктів, створених базою даних, - постійні, незмінні значення.
// Але також підходить будь - яке унікальне значення якої-небудь властивості об'єкта.

// const favouriteBooks = [
//   { id: "id-1", name: "JS for beginners" },
//   { id: "id-2", name: "React basics" },
//   { id: "id-3", name: "React Router overview" }
// ];

// const BookList = ({ books }) => {
//   return (
// 		<ul>
// 			{books.map((book) => {
// 			  return <li key={book.id}>{book.name}</li>;
// 			})}
// 		</ul>
//   );
// };

// const App = () => {
//   return (
//     <>
// 			<h1>Books of the week</h1>
//       <BookList books={favouriteBooks} />
//     </>
//   );
// };

//!! Якщо об'єкти масиву не мають унікальних значень властивостей і колекція не редагується (наприклад, користувач не може видалити
//!! або змінити порядок елементів), можна використовувати індекси масиву.

// const favouriteBooks = [
//   { name: "JS for beginners" },
//   { name: "React basics" },
//   { name: "React Router overview" }
// ];

// const BookList = ({ books }) => (
//   <ul>
// 		{books.map((book, index) => {
// 		  return <li key={index}>{book.name}</li>;
// 		})}
//   </ul>
// );

// Використання індексів для ключів — це крайній випадок.
// В переважній більшості випадків дані мають унікальні ідентифікатори або інші властивості.

//!! 📖 Документація щодо роботи зі списками: https://react.dev/learn/rendering-lists -->

//* Властивість props.children *-->

// До цього ми використовували компоненти як одиночні, самозакриваючі теги і явно передавали їм дані через пропси.
// Це стосується більшості випадків використання компонентів.

// // Оголошення
// const Card = ({ text }) => {
//   return <div>{text}</div>;
// };

// // Використання
// <Card text="Message as a text prop" />

// Давайте розберемося, що буде, якщо використовувати компонент Card із вмістом між відкриваючим і закриваючим тегами.

// {
//   /* <Card>Text between opening and closing tag</Card> */
// }

// Якщо відобразити компонент Card у браузері, то ми не побачимо тексту, який знаходиться між відкриваючим і закриваючим тегами компонента.
// React просто не знає, куди ми хочемо відобразити цей вміст.

// Все, що знаходиться між відкриваючим і закриваючим тегом компонента, доступно в службовому пропсі props.children, який є у всіх
// компонентів.

// // Оголошення const
// Card = ({ children }) => { return

// <div>{children}</div>; };

// // Використання
// <Card>Text between opening and closing tag</Card>

// Значенням props.children може бути будь-що, включаючи теги та інші компоненти будь-якої складності.

// // Оголошення
// const Card = ({ children }) => {
//   return <div>{children}</div>;
// };

// // Використання
// <Card>
// 	<h1>Card title</h1>
// 	<p>Text between opening and closing tag</p>
// </Card>

//!! Концепція дочірніх елементів дозволяє робити композицію компонентів і використовується в більш складних завданнях.
//!! На даному етапі знайомства с компонентами важливо знати, що існує ** props.children ** і що значенням цього пропса буде те,
//!! що знаходиться між відкриваючим і закриваючим тегом компонента.

//* Рендер додатка в DOM *
// Для того, щоб відрендерити всі компоненти додатка в DOM, в пакеті react - dom є методи createRoot(container) та render(element),
// які працюють разом. Це виконується в файлі main.jsx.

// // src/main.jsx

// import React from "react";
// import ReactDOM from "react-dom/client";
// import App from "./App.jsx";

// ReactDOM.createRoot(document.getElementById("root")).render(
//   <React.StrictMode>
//     <App />
//   </React.StrictMode>
// );

// Метод createRoot приймає посилання на існуючий DOM - елемент, у нашому випадку це div#root з index.html, і створює корінь, в який буде
// рендеритися додаток.Метод render приймає посилання на компонент, який потрібно відрендерити.Ми завжди рендеримо App - кореневий
// компонент додатка.

// Достатньо використовувати лише один виклик render для того, щоб відрендерити найвищий компонент в ієрархії(App), що призведе до рендеру
// всіх інших компонентів додатка.

//?? Суворий режим
// Можливо, у вас виникає питання, що таке <React.StrictMode>, в який вкладений компонент App.

// ReactDOM.createRoot(document.getElementById("root")).render(
//   <React.StrictMode>
//     <App />
//   </React.StrictMode>
// );

//!! Це вбудований компонент, який дозволяє виявляти потенційні проблеми в компонентах додатка та попереджати про них під час розробки.
//!! Він не впливає на виконання додатка у продакшені, але допомагає знаходити та виправляти проблеми під час розробки.

//!! Основні функції StrictMode:
// - Сповіщення про використання застарілих методів і функцій в React, які можуть
//   бути вилучені в майбутніх версіях.
// - Виявлення побічних ефектів під час рендерингу компонентів, що може призвести
//   до непередбачуваної поведінки.
// - Сповіщення про потенційні проблеми в render-методах, такі як виклик нечистих
//   функцій під час рендерингу.
// - Виявлення помилок у функціях обробки подій та їх інших частинах життєвого
//   циклу компонентів.

//!! 📖 Документація StrictMode: https://react.dev/reference/react/StrictMode

//* Односторінковий застосунок *

// У сучасній веб - розробці змінилися не тільки техніки, що дозволяють веб - сайтам виглядати краще, завантажуватися швидше і бути приємнішими
// у використанні. Насамперед змінилися фундаментальні речі - те, як ми проєктуємо та створюємо веб-застосунки.

// Візьмемо довільний веб - сайт, наприклад, для роботи з колекцією рецептів, розкладом тренувань тощо.
// Завжди є набір сторінок: домашня, профіль, сторінка колекції та сторінка одного елемента колекції.

// Сучасний підхід - сайт, на якому користувач ніколи не переходить на інші HTML - сторінки.
// Інтерфейс, замість запиту HTML - документів з сервера, перемальовується в браузере, на одній і тій самій сторінці, без перезавантаження.
// Такий додаток називається SPA(Single Page Application, односторінковий застосунок), і це саме те, що ми разом з вами почали вивчати.

// У наступних модулях ми розглянемо, як зробити веб - додаток динамічним та багатосторінковим, але незважаючи на це, при завантаженні сайту
// сервер завжди буде віддавати HTML-сторінку index.html, а оновлення інтерфейсу буде відбуватися динамічно в закладці браузера.

//* Типізація пропсів *

// Перевірка типів отриманих компонентом пропсів може допомогти виявити помилки.
// Наприклад, якщо ви очікуєте у пропсі масив, але при використанні компонента випадково передали число або інше неприпустиме значення.

// Опис типів пропсів може заощадити час на дебаг і допомагати при неуважності.
// У майбутньому буде необхідно виділити час і ознайомитися з TypeScript, а для початку вистачить невеликої бібліотеки.

// Опис типів пропсів не є обов'язковим. Крім того, що типізація пропсів може заощадити час при виявленні помилок, весь процес типізації
// займає час розробника, так як це додатковий код. Використовуйте цю можливість лише за бажанням.

// Пакет prop - types надає низку валідаторів для перевірки коректності отриманих типів даних під час виконання коду, повідомляючи про
// невідповідності в консолі.

//!! npm install --save-dev prop-types -->

// Використаємо prop - types і опишемо пропси компонента Product.
// Все, що необхідно зробити, це описати типи пропсів, які компонент отримує, в спеціальній властивості propTypes.

// src/components/Product.jsx

// import PropTypes from 'prop-types';

// const Product = ({
//  name,
//  imgUrl = "https://dummyimage.com/640x480/2a2a2a/ffffff&text=Product+image+placeholder",
//  price,
// }) => (
//  <div>
// 		<img src={imgUrl} alt={name} width="480" />
// 		<h2>{name}</h2>
//    <p>Price: {price} credits</p>
//  </div>
// );

// // Опис типів пропсів компонента
// Product.propTypes = {
//   name: PropTypes.string.isRequired,
//   imgUrl: PropTypes.string,
//   price: PropTypes.number.isRequired,
// };

// export default Product;

// Перевірка пропсів за допомогою prop-types відбувається тільки під час розробки.

//** Заняття 2. Вбудовані стилі **-->

// Існує кілька способів стилізації компонентів, найпростіший, але в той же час найбільш обмежений - це вбудовані стилі.
// Для цього використовується атрибут style, який у React приймає не рядок, а об'єкт стилів.

// // src/components/App.jsx

// export const App = () => {
//   return (
//     <p
//       style={{
//         margin: 8,
//         padding: "12px 16px",
//         borderRadius: 4,
//         backgroundColor: "gray",
//         color: "white",
//       }}
//     >
//       Please update your email!
//     </p>
//   );
// };

//!! З прикладу можна виділити кілька обов'язкових правил вбудованих стилів:
// - Імена властивостей, що складаються з двох і більше слів, наприклад
//   background-color, обов'язково повинні бути записані в camelCase нотації
//   (backgroundColor), як при зверненні до властивостей об'єкта style у
//   DOM-елемента.
// - До числових значень більшості властивостей буде автоматично додано суфікс px.
//   Якщо необхідно використовувати одиниці відмінні від px, або значення
//   складається з кількох частин, воно вказується як рядок.

// Винесемо об'єкт стилів у змінну, щоб підвищити читабельність JSX розмітки.

// // src/components/App.jsx

// const alertStyles = {
//   margin: 8,
//   padding: "12px 16px",
//   borderRadius: 4,
//   backgroundColor: "gray",
//   color: "white",
// };

// export const App = () => {
//   return (
//     <>
//       <p style={alertStyles}>Please update your email!</p>
//       <p style={alertStyles}>There was an error during transaction!</p>
//       <p style={alertStyles}>Payment received, thank you for your purchase!</p>
//     </>
//   );
// };

// Створимо компонент Alert який буде рендерити абзац тексту та приховає у собі майбутню логіку вибору кольору фону.

// //src/components/Alert.jsx

// const alertStyles = {
//   margin: 8,
//   padding: "12px 16px",
//   borderRadius: 4,
//   backgroundColor: "gray",
//   color: "white",
// };

// export const Alert = ({ children }) => {
//   return <p style={alertStyles}>{children}</p>;
// };

// Використовуємо компонент Alert для рендеру декількох повідомлень.

// // src/components/App.jsx

// import { Alert } from "./Alert";

// export const App = () => {
//   return (
//     <>
//       <Alert>Please update your email!</Alert>
//       <Alert>There was an error during transaction!</Alert>
//       <Alert>Payment received, thank you for your purchase!</Alert>
//     </>
//   );
// };

//?? Динамічні стилі
// Зробимо так, щоб залежно від типу оповіщення, у компоненті Alert змінювався колір фону абзацу.
// Для цього додамо йому обов'язковий пропс variant з кількома можливими значеннями.

// // src/components/App.jsx

// import { Alert } from "./Alert";

// const App = () => {
//   return (
//     <>
//       <Alert variant="info">
//         Would you like to browse our recommended products?
//       </Alert>
//       <Alert variant="error">
//         There was an error during your last transaction
//       </Alert>
//       <Alert variant="success">
//         Payment received, thank you for your purchase
//       </Alert>
//       <Alert variant="warning">
//         Please update your profile contact information
//       </Alert>
//     </>
//   );
// };

// Логіку вибору кольору винесемо у функцію getBgColor(variant), яка буде повертати рядок із назвою кольору залежно від значення
// параметра variant.

// // src/components/Alert.jsx

// const alertStyles = {
//   margin: 8,
//   padding: "12px 16px",
//   borderRadius: 4,
//   color: "white",
// };

// const getBgColor = variant => {
//   switch (variant) {
//     case "info":
//       return "blue";
//     case "success":
//       return "green";
//     case "error":
//       return "red";
//     case "warning":
//       return "orange";
//     default:
//       throw new Error(`Unsupported variant prop value - ${variant}`);
//   }
// };

// export const Alert = ({ variant, children }) => {
//   return (
//     <p
//       style={{
//         ...alertStyles,
//         backgroundColor: getBgColor(variant),
//       }}
//     >
//       {children}
//     </p>
//   );
// };

//!! На 25-му рядку прикладу відбувається створення фінального значення атрибуту style - базові стилі з alertStyles та динамічне
//!! значення backgroundColor залежно від пропсу variant.Такий підхід застосовується у разі коли значення однієї і більше властивостей
//!! залежить від пропсів.Наприклад, якщо посилання на зображення для background - image передається як пропс.

// Розберіть код живого прикладу в якому використовується матеріал, який ми розібрали до цього моменту.

//!! Висновок -->
// - Вбудовані стилі можуть видаватися зручними через простоту використання, але
//   вони мають ряд істотних недоліків.
// - Дуже слабка масштабованість та повторне використання стилів.
// - Обмежені можливості (псевдокласи, псевдоелементи, адаптивні властивості).
// - Погана продуктивність при відмальовуванні досить великої кількості елементів.
// - Відсутність зручних інструментів розробника.
// - Немає підтримки в популярних інструментах, наприклад autoprefixer.

// На практиці вбудовані стилі використовуються тільки для динамічно обчислюваних значень властивостей, у парі із зовнішніми таблицями стилів.
// В якості основного способу стилізації компонентів вбудовані стилі не використовуються в проєктах та тому не рекомендуються.

//* Ванільний CSS *

// Оформлення компонента можна винести до таблиці стилів.
// У цьому випадку стилі кожного компонента оголошуються в окремому CSS - файлі з розширенням.css.
// Ім'я файлу складається з імені компонента та розширення.
// Наприклад, для компонента Alert, файл стилів буде називатися Alert.css.

// /* src/components/Alert.css */

// .alert {
//   margin: 8px;
//   padding: 12px 16px;
//   border-radius: 4px;
//   background-color: gray;
//   color: white;
// }

//!! Всередині файлу стилів можна написати будь-який валідний CSS код. Хорошою практикою буде писати CSS тільки для HTML-розмітки
//!! компонента до якого належить цей файл стилів.

// Стилі компонента імпортуються у файл оголошення компонента, після чого CSS - класи описані у таблиці стилів доступні для використання.
// У React HTML - атрибуту class відповідає JSX - атрибут className, куди можна передати рядок з перерахуванням усіх класів елемента.

// // src/components/Alert.jsx

// import "./Alert.css";

// const Alert = ({ children }) => {
//   return <p className="alert">{children}</p>;
// };

// На стадії збирання проекту Vite мінімізує CSS та автоматично додає вендорні префікси використовуючи Autoprefixer.
// Сучасний синтаксис та можливості CSS покриваються поліфілами для можливості підтримки старих браузерів.
// Тому розробнику не потрібно турбуватися про це.

//* Композиція класів *

// Додамо CSS класи для кожного типу оповіщення, щоб контролювати колір фону абзацу в залежності від значення пропсу variant.
// Для зручності назвемо класи аналогічно варіантам значення пропсу.

// /* src/components/Alert.css */

// .alert {
//   margin: 8px;
//   padding: 12px 16px;
//   border-radius: 4px;
//   color: white;
// }

// .alert.info {
//   background-color: blue;
// }

// .alert.success {
//   background-color: green;
// }

// .alert.error {
//   background-color: red;
// }

// .alert.warning {
//   background-color: orange;
// }

// Процес обчислення фінального значення атрибуту className залежить від розробника та поточного завдання.
// Наприклад, використовуємо масив рядків та метод join щоб отримати рядок класів.

// // src/components/Alert.jsx

// import "./Alert.css";

// const Alert = ({ variant, children }) => {
//   const classNames = ["alert", variant];

//   return <p className={classNames.join(" ")}>{children}</p>;
// };

// Додамо компоненту Alert два необов'язкові пропси outlined та elevated.
// Їх значеннями можуть бути тільки true, false або undefined.
// Якщо значення цих пропсів true, будемо додавати елементу < p > класи is - outlined та is - elevated.

// /* src/components/Alert.css */

// /* Весь попередній CSS код */

// .alert.is-outlined {
//   outline: 1px solid black;
// }

// .alert.is-elevated {
//   box-shadow: rgb(0 0 0 / 20%) 0px 3px 3px -2px, rgb(0 0 0 / 14%) 0px 3px 4px 0px,
//     rgb(0 0 0 / 12%) 0px 1px 8px 0px;
// }

// Клас alert і якийсь із варіантів буде завжди, а класи для пропсів elevated та outlined додаємо тільки за потребою використовуючи блок if.

// src/components/Alert.jsx
// import "./Alert.css";

// const Alert = ({ variant, outlined, elevated, children }) => {
//   const classNames = ["alert", variant];

//   if (outlined) {
// 		classNames.push("is-outlined");
// 	}

//   if (elevated) {
// 		classNames.push("is-elevated");
// 	}

//   return <p className={classNames.join(" ")}>{children}</p>;
// };

//!! Для обчислення фінального значення атрибуту className можна було використати блок if...else, інструкцію switch,
//!! тернарний оператор або будь - який інший синтаксис JavaScript, який дасть нам той же результат.
//!! Головне, щоб рядок з класами був складений правильно і не мав зайвих чи невалідних значень.

//* Бібліотека clsx *

// Для вирішення більшості завдань, пов'язаних з безліччю класів, що задаються згідно з певними умовами, використовують бібліотеку clsx.
// Звичайно, JavaScript надає багатий синтаксис, але здебільшого пишуться непродуктивні рішення або код, що погано читається.
// Бібліотека стандартизує цей процес і робить його більш зручним за рахунок продуманого синтаксису.

//!! npm install clsx -->

// Функції clsx можна передати список виразів як набір аргументів.
// Вирази що приводяться до true, результат яких це рядок або число, буде додано у фінальний рядок класів.

// import clsx from "clsx";

// const className = clsx(
//   "first",
//   10,
//   undefined && "second",
//   true && "third",
//   false ? "fourth" : "fifth"
// );
// console.log(className); // "first 10 third fifth"

// Ось як виглядатиме код компонента Alert використовуючи бібліотеку clsx.
// Навіть у такому, відносно простому випадку, код виходить простіше і читабельніше.

// // src/components/Alert.jsx

// import clsx from "clsx";
// import "./Alert.css";

// const Alert = ({ variant, outlined, elevated, children }) => {
//   return (
//     <p
//       className={clsx(
//         "alert",
//         variant,
//         outlined && "is-outlined",
//         elevated && "is-elevated"
//       )}
//     >
//       {children}
//     </p>
//   );
// };

// Можна комбінувати варіативну та об'єктну форму функції clsx.
// Спочатку передаються класи, які будуть завжди, після чого в об'єкті налаштувань перераховуємо динамічні значення класів залежно
// від якихось обчислень.Нам здається, що така форма запису є більш декларативною та зрозумілою, тому рекомендуємо використовувати саме її.

// src/components/Alert.jsx

// import clsx from "clsx";
// import "./Alert.css";

// const Alert = ({ variant, outlined, elevated, children }) => {
//   return (
//     <p
//       className={clsx("alert", variant, {
//         "is-outlined": outlined,
//         "is-elevated": elevated,
//       })}
//     >
//       {children}
//     </p>
//   );
// };

// Розберіть код живого прикладу, в якому використовується весь матеріал, який ми з вами розібрали до цього моменту.

//* Глобальний простір імен *

// Імпорт стилів компонента саме у файл його оголошення це просто гарна практика.
// Наприклад, якщо зробити імпорт стилів Alert.css у компоненті App, то нічого не зламається.
// В результаті імпорту весь оголошений CSS код файлу просто додається в одну загальну таблицю стилів, разом з усім іншим CSS кодом проекту з інших
// компонентів.

// У коді прикладу буде проблема конфлікту CSS правил із селектором класу .text.
// Залежно від порядку імпорту цих двох CSS файлів у додатку фінальні стилі класу text можуть виглядати по - різному.

// /* FirstComponent.css */
// .text {
//   color: red;
//   font-size: 24px;
// }

// /* SecondComponent.css */
// .text {
//   color: blue;
// }

//!! Імена селекторів класів повинні бути унікальними у всьому додатку, щоб уникнути конфліктів CSS-правил з однаковими селекторами
//!! у різних компонентах.Це є одним із недоліків використання ванільного CSS.

//!! Використання ванільного CSS теж не найкращий підхід і має ряд недоліків, особливо у великих проектах:
// - Слабка масштабованість.
// - Обмежене повторне використання стилів.
// - Для динамічних значень необхідно використовувати вбудовані стилі.
// - Проблема глобального простору імен.
// - Необхідність використовувати якусь конвенцію іменування селекторів класу.

//* Повторне використання стилів *

// Не рекомендується використовувати одні й ті самі CSS - класи в різних компонентах, для цього є композиція компонентів.
// Наприклад, замість використання базового CSS-класу .button у компонентах <LoginButton> та <FollowButton>, краще створити
// компонент < Button > зі своїми власними стилями, які можуть відображатись у кількох варіантах.
// Тоді компоненти < LoginButton > та < FollowButton > можуть використовувати компонент <Button>, а не просто CSS-клас.

// // Button.jsx
// const Button = ({ variant, children }) => {
//   // Базові стилі кнопки з кількома варіантами відображення
//   return <button className={clsx("button", variant)}>{children}</button>;
// };

// // LoginButton.jsx
// const LoginButton = () => {
//   // Унікальна логіка кнопки логіна
//   return <Button variant="primary">Login</Button>;
// };

// // FollowButton.jsx
// const FollowButton = () => {
//   // Унікальна логіка кнопки підписки
//   return <Button variant="secondary">Follow</Button>;
// };

//* CSS-модулі *-->

// CSS - модулі - це не офіційна специфікація, вони не імплементовані в браузери.
// Це процес, що запускається на стадії складання проєкту (наприклад, за допомогою Vite), в результаті виконання якого імена класів замінюються на унікальні. Це
// дозволяє використовувати одне і те ж ім'я класу в різних CSS-файлах, не турбуючись про конфлікти імен.
// Цей підхід був розроблений, щоб вирішити проблему глобальної області видимості в CSS.

// Vite за замовчуванням підтримує CSS - модулі, все, що необхідно зробити це створювати файли стилів з розширенням.module.css,
//!! наприклад Alert.module.css.
// Всередині модуля CSS можна використовувати будь - який валідний CSS.

// /* src/components/Alert.module.css */

// .alert {
//   margin: 8px;
//   padding: 12px 16px;
//   border-radius: 4px;
//   background-color: gray;
//   color: white;
// }

// Синтаксис імпорту CSS - модуля нагадує імпорт файлу JavaScript модуля.
// У CSS - модулі є експорт за замовчуванням - об'єкт відповідності оригінального та згенерованих імен класів.

// // src/components/Alert.jsx

// // Синтаксис імпорту CSS-модуля
// import css from "./Alert.module.css";

// // Отримуємо об'єкт відповідності імен класів
// console.log(css); // { alert: "Alert_alert_ax7yz" }

// const Alert = ({ children }) => {
//   // Звертаємось до властивості об'єкта на ім'я класу з файлу CSS-модуля
//   return <p className={css.alert}>{children}</p>;
// };

// Селектори тегів за замовчуванням будуть у глобальній області видимості,
// CSS-модулі генерують лише унікальні імена селекторів класу.

//?? Властивість composes -->

// Композиція селекторів це одна з ключових можливостей CSS - модулів, яка дозволяє створювати клас, наслідуючи стилі іншого класу,
// але не дублюючи їх.Використовуємо композицію класів та виконаємо рефакторинг стилів компонента Alert.
// Наслідуємо стилі базового класу.alert у всіх класах варіантів.
// Властивість composes має передувати іншим правилам, щоб можна було перевизначити стилі, якщо це необхідно.

// /* src/components/Alert.module.css */

// .alert {
//   margin: 8px;
//   padding: 12px 16px;
//   border-radius: 4px;
//   background-color: gray;
//   color: white;
// }

// .info {
//   composes: alert;
//   background-color: blue;
// }

// .success {
//   composes: alert;
//   background-color: green;
// }

// .error {
//   composes: alert;
//   background-color: red;
// }

// .warning {
//   composes: alert;
//   background-color: orange;
// }

// При композиції у простих випадках можна обійтися без бібліотеки clsx.
// Не задаємо базовий клас alert, тому що від нього виконано композицію класів варіантів.
// В результаті на елементі <p> будуть два класи, базовий alert і клас варіанта, у
// якому перевизначається значення кольору фону.

// // src/components/Alert.jsx

// import css from "./Alert.module.css";

// const Alert = ({ variant, children }) => {
//   return <p className={css[variant]}>{children}</p>;
// };

// До властивостей об'єкта зазвичай звертаються як css.alert, але можна
// використовувати квадратні дужки, наприклад css["alert"]. Це корисно у випадку
// коли ім'я властивості зберігається у змінній, як у нас у пропсі variant.

//?? Бібліотека clsx
// Додамо CSS класи для вже знайомих нам пропсів outlined та elevated.
// Імена класи, що складаються з декількох слів записують у CamelCase нотації.
// В протилежному випадку, оскільки вони стають властивостями об'єкта, звертатися до них доведеться через квадратні дужки,
// наприклад css["is-outlined"], що менш зручно.

// // src/components/Alert.jsx

// import clsx from "clsx";
// import css from "./Alert.module.css";

// const Alert = ({ variant, outlined, elevated, children }) => {
//   return (
//     <p
//       className={clsx(css[variant], {
//         [css.isOutlined]: outlined,
//         [css.isElevated]: elevated,
//       })}
//     >
//       {children}
//     </p>
//   );
// };

// Тепер ми знову використовуємо бібліотеку clsx для складання фінального значення властивості className.

// // src/components/Alert.jsx

// import clsx from "clsx";
// import css from "./Alert.module.css";

// const Alert = ({ variant, outlined, elevated, children }) => {
//   return (
//     <p
//       className={clsx(css[variant], {
//         [css.isOutlined]: outlined,
//         [css.isElevated]: elevated,
//       })}
//     >
//       {children}
//     </p>
//   );
// };

//* Нормалізація стилів *

// Стилі елементів можуть відрізнятись між браузерами.
// Щоб привести їх до стандартного вигляду, необхідно додати набір правил, що виправляє відмінності у стилях елементів між різними браузерами.
// Ми використаєм сучасну бібліотеку modern-normalize для додавання стилів нормалізації до проекту. Спочатку додамо її як залежність проекту.

//!! npm install modern-normalize -->

//!! Після цього в файлі main.jsx ми імпортуємо стилі нормалізації. Це додасть стилі з файлу нормалізації до проекту. -->
// import React from "react";
// import ReactDOM from "react-dom/client";
// // Імпорт стилів нормалізації
// import "modern-normalize";
// import App from "./components/App.jsx";
// import "./index.css";

// ReactDOM.createRoot(document.getElementById("root")).render(
//   <React.StrictMode>
//     <App />
//   </React.StrictMode>
// );

// Крім стандартизації зовнішнього вигляду елементів, може бути корисно скинути або додати деякі глобальні стилі для елементів.
// Наприклад, відступи для списків та заголовків, стилі для зображень, стилі для елемента < body >, тощо.
// Це можна логічно зробити в файлі index.css. Тут ви можете додати будь-які необхідні вам глобальні стилі для тегів.

// /* src/index.css */

// body {
//   font-family: sans-serif;
//   line-height: 1.5;
// }

// h1,
// h2,
// h3,
// h4,
// h5,
// h6,
// p {
//   margin: 0;
// }

// ul,
// ol {
//   margin: 0;
//   padding: 0;
// }

// img {
//   display: block;
//   max-width: 100%;
// }

//* Бібліотека React Icons *-->

//!! React Icons - це набір іконок, спеціально створений для використання в React-додатках.  -->

// Вона дозволяє легко та зручно вбудовувати іконки в компоненти React, спрощуючи використання векторних графічних символів.

// Додавання бібліотеки до проекту виконується за допомогою NPM-пакету:

//!! npm install react-icons -->
// Бібліотека включає в себе широкий спектр різноманітних іконок, представляючи популярні набори, такі як Font Awesome, Material Icons,
// Ionicons та багато інших.

// Для використання іконок вам потрібно лише імпортувати потрібний компонент та включити його в ваш JSX - код.
// Наприклад, на веб - сайті React Icons є зручний графічний інтерфейс, де можна вибрати іконку та скопіювати необхідний код.

// Наприклад, додамо іконку користувача з набору "Hero Icons" ліворуч від його імені:

// import { HiUser } from "react-icons/hi";

// const UserMenu = ({ name }) => {
//   return (
//     <div>
//       <p><HiUser /> {name}</p>
//     </div>
//   );
// };

// Ви можете легко налаштовувати зовнішній вигляд іконок, використовуючи стилі React, передаючи власні класи або інші параметри.

// import { HiUser } from "react-icons/hi";

// const UserMenu = ({ name }) => {
//   return (
//     <div>
//       <p><HiUser className="my-icon" size="24" /> {name}</p>
//     </div>
//   );
// };

// Колір іконки вказується в додатковому класі CSS - властивістю color.
// Розмір іконки визначається числом в атрибуті size, це кількість пікселів.
// За замовчуванням розмір іконок - 16px.
